var cat1_num = new Array(1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17);
var cat1_name = new Array('서울','부산','대구','인천','광주','대전','울산','강원','경기','경남','경북','전남','전북','제주','충남','충북','세종');
var cat2_num = new Array();
var cat2_name = new Array();

cat2_num[1] = new Array(18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66);
cat2_name[1] = new Array('종로구','중구성동구갑','중구성동구을','용산구','광진구갑','광진구을','동대문구갑','동대문구을','중랑구갑','중랑구을','성북구갑','성북구을','강북구갑','강북구을','도봉구갑','도봉구을','노원구갑','노원구을','노원구병','은평구갑','은평구을','서대문구갑','서대문구을','마포구갑','마포구을','양천구갑','양천구을','강서구갑','강서구을','강서구병','구로구갑','구로구을','금천구','영등포구갑','영등포구을','동작구갑','동작구을','관악구갑','서초구갑','서초구을','강남구갑','강남구을','강남구병','송파구갑','송파구을','송파구병','강동구갑','강동구을');

cat2_num[2] = new Array(67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84);
cat2_name[2] = new Array('중구영동구','서구동구','부산진구갑','부산진구을','동래구','남구갑','남구을','북구강서구갑','북구강서구을','해운대구갑','해운대구을','사하구갑','사하구을','금정구','연제구','수영구','사상구','기장군');

cat2_num[3] = new Array(85,86,87,88,89,90,91,92,93,94,95,96);
cat2_name[3] = new Array('중구남구','동구갑','동구을','서구','북구갑','북구을','수성구갑','수성구을','달서구갑','달서구을','달서구병','달성군');

cat2_num[4] = new Array(97,98,99,100,101,102,103,104,105,106,107,108,109);
cat2_name[4] = new Array('중구강화군웅진군','동구미추홀구갑','동구미추홀구을','연수구갑','연수구을','남동구갑','남동구을','부평구갑','부평구을','계양구갑','계양구을','서구갑','서구을');

cat2_num[5] = new Array(110,111,112,113,114,115,116,117,118);
cat2_name[5] = new Array('동구남구갑','동구남구을','서구갑','서구을','북구갑','북구을','광산구갑','광산구을');

cat2_num[6] = new Array(119,120,121,122,123,124,125);
cat2_name[6] = new Array('동구','중구','서구갑','서구을','유성구갑','유성구을','대덕구');

cat2_num[7] = new Array(126,127,128,129,130,131);
cat2_name[7] = new Array('중구','남구갑','남구을','동구','북구','울주군');

cat2_num[8] = new Array(132,133,134,135,136,137,138,139,140);
cat2_name[8] = new Array('춘천시철원군화천군양구군갑','춘천시철원군화천군양구군을','원주시갑','원주시을','강릉시','동해시태백시삼척시정선군','속초시인제군고성군양양군','홍천군횡성군영월군평창군');

cat2_num[9] = new Array(141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199);
cat2_name[9] = new Array('수원시갑','수원시을','수원시병','수원시정','수원시무','성남시수정구','성남시중원구','성남시분당구갑','성남시분당구을','의정부시갑','의정부시을','안양시만악구','안양시동안구갑','안양시동안구을','부천시갑','부천시을','부천시병','부천시정','광명시갑','광명시을','평택시갑','평택시을','동두천시연천군','안산시상록구갑','안산시상록구을','안산시단원구갑','안산시단원구을','고양시갑','고양시을','고양시병','고양시정','의왕시과저천시','구리시','남양주시갑','남양주시을','남양주시병','오산시','시흥시갑','시흥시을','군포시','하남시','용인시갑','용신이을','용인시병','용신시정','파주시갑','파주시을','이천시','안성시','김포시갑','김포시을','화성시갑','화성시을','화상시병','광주시갑','광주시을','양주시','포천시가평군','여주시양평군');

cat2_num[10] = new Array(200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215);
cat2_name[10] = new Array('창원시의창구','창원시성산구','창원시마산합포구','창원시마산회원구','창원시진해구','진주시갑','진주시을','통영시고성군','사천시남해군하동군','김해시갑','김해시을','밀양시의령군함안군창녕군','거제시','양산시갑','양산시을','산청군함양군거창군합천군');

cat2_num[11] = new Array(216,217,218,219,220,221,222,223,224,225,226,227,228,229);
cat2_name[11] = new Array('포항시북구','포항시남구울릉군','경주시','김천시','안동시예천군','구미시갑','구미시을','영주시영양군봉화군울진군','영천시청도군','상주시문경시','경산시','군위군의성군청송군영덕군','고령군성주군칠곡군');

cat2_num[12] = new Array(230,231,232,233,234,235,236,237,238,239,240);
cat2_name[12] = new Array('목포시','여수시갑','여수시을','순천시광양시곡성군구례군갑','순천시광양시곡성군구례군을','나주시화순군','담양군함평군영광군장성군','고흥군보성군장흥군강진군','해남군완도군진도군','영암군무안군신안군');

cat2_num[13] = new Array(241,242,243,244,245,246,247,248,249,250);
cat2_name[13] = new Array('전주시갑','전주시을','전주시병','군산시','익산시갑','익산시을','정읍시고창군','남원시임실군순창군','김제시부안군','완주군진안군무주군장수군');

cat2_num[14] = new Array(251,252,253);
cat2_name[14] = new Array('제주시갑','제주시을','서귀포시');

cat2_num[15] = new Array(254,255,256,257,258,259,260,261,262,263,264);
cat2_name[15] = new Array('천안시갑','천안시을','천안시병','공주시부여군청양군','보령시서천군','아산시갑','아산시을','서산시태안군','논산시계룡시금산군','당진시','홍성군예산군');

cat2_num[16] = new Array(265,266,267,268,269,270,271,272);
cat2_name[16] = new Array('청주시상당구','청주시서원구','청주시흥덕구','청주시청원구','충주시','제천시단양군','보은군옥천군영동군괴산군','증평군진천군음성군');

cat2_num[17] = new Array(273,274);
cat2_name[17] = new Array('세종특별자치시갑','세종특별자치시을');
function cat1_change(key,sel){
if(key == '') return;
var name = cat2_name[key];
var val = cat2_num[key];

for(i=sel.length-1; i>=0; i--)
sel.options[i] = null;
sel.options[0] = new Option('-선택-','', '', 'true');
for(i=0; i<name.length; i++){
    sel.options[i+1] = new Option(name[i],val[i]);
}
}
